// Example.js
import React, { Component } from "react";
import Carousel from "react-spring-3d-carousel";
import { v4 as uuidv4 } from "uuid";
import { config } from "react-spring";
import Poem from "./Poem";

const getTouches = (evt) => {
  return (
    evt.touches || evt.originalEvent.touches // browser API
  );
};

export default class Example extends Component {
  state = {
    goToSlide: 0,
    offsetRadius: 2,
    showNavigation: true,
    enableSwipe: true,
    config: config.slow
  };

  poems = [
    {
        title: "Зустріч з сонцем",
        text: `
        Кожен день був самотній й безсонний,
        А всередині лиш ритм серця монотонний.
        Що б не ставалося у моєму житті,
        Не видно емоцій в скляному відбитті.
        Свята, пригоди та драми?
        Вони не ставали для мене дарами.
  
        Так би і продовжувалося далі,
        Якби не зустрів тебе посеред своєї печалі.
        Момент цей став моїм початком новим,
        А ти дала мені можливість побути живим.
  
        Іскра що так різко спалахнула між нами,
        Освітила мій світ теплими тонами.
        Час що я провів з тобою,
        Дозволив мені нарешті побути собою.
  
        Розмови з тобою мене зігрівали,
        Та емоції прекрасні дарували.
        Твої манери, голос та сміх,
        Розтопили одвічний мій сніг.
  
        Для мене ти настільки прекрасна,
        Немов та зірка далека й незгасна.
        Так хочу тебе обійняти,
        Та ніколи не відпускати..
  
        Хочу в лісі з тобою лежати,
        Та за плечі тебе ніжно держати.
        Хочу вічно тобі книги читати,
        Та за руку міцно тримати.`,
        date: "16.08.2023"
      },
      {
        title: "Думки про весну",
        text: `
        Всі дні мої думки в твоєму полоні,
        Лиш хочу торкнутися твоєї долоні.
        Рукою ніжно по лицю провести,
        Та пальці тісно переплести.

        Так хочеться бути поруч з тобою,
        Та ринути в море щастя й покою.
        Поплисти й розчинитися в ньому,
        І не віддавати тебе ніколи й нікому.

        Дні з тобою мене так сильно змінили,
        Навіть мій розум схоже сп'янили.
        Проте серце моє справді радіє,
        А холодність все тане й рідіє.

        Твоя ніжність мене підкорила,
        А наглість цікавість створила.
        Почуття з тобою несамовито палають,
        А підозри й сумніви різко згасають.

        Життя до тебе було суцільною зимою,
        То чи станеш ти моєю весною?`,
        date: "19.08.2023"
      },
      {
        title: "Сотня причин",
        text: `
        За що ж я тебе так кохаю?
        Навіть не знаю нащо причину шукаю.
        Адже вона далеко не одна,
        І списку цьому кінця мабуть нема.
        Проте висловити свої почуття я бажаю,
        Тож все що тільки можу пригадаю.

        Я кохаю тебе за голос прекрасний,
        Від якого день стає ясний.
        Я кохаю тебе за твій солодкий сміх,
        Що робить мене щасливішим будь-яких втіх.
        Я кохаю тебе за твої добрі слова,
        Від яких сум мій швидко сплива.
        Я кохаю тебе за повідомлення милі,
        Що в серці створюють хвилі.
        Я кохаю тебе за твою вперту поведінку,
        Що дає моєму життю нового відтінку.
        Я кохаю тебе за твою сором'язливість,
        Що дає змогу побачити твою чутливість.
        Я кохаю тебе за твою непокірність,
        За якою ховається ніжності безмірність.
        Я кохаю тебе за час що ти даруєш мені,
        Який дає зможу вдихнути в цій метушні.
        Я кохаю тебе за натхнення,
        Що красить моє сьогодення.
        Я кохаю тебе за наше майбутнє,
        В якому все погане буде відсутнє.
        Я кохаю тебе за твоє терпіння,
        Яке дає прощати мої помилки дивне уміння.
        Я кохаю тебе за твою унікальність,
        Що стирає з стосунків наших банальність.
        Я кохаю тебе за розуміння,
        Яке дає мені надії проміння.
        Я кохаю тебе за твою підтримку,
        Що розпалює вогонь в мені навіть узимку.
        Я кохаю тебе за нашу "справедливість",
        Що лиш нагадує про твою особливість.
        Я кохаю тебе за кожен твій жарт,
        Що мого щирого сміху повністю варт.
        Я кохаю тебе за твоє піклування,
        Що підтримує моє існування.
        Я кохаю тебе за наше щастя,
        Яке дає віру що у нас все вдасться.
        Я кохаю тебе за твою вірність,
        Що заслуговує на поваги безмірність.
        Я кохаю тебе за твої компліменти,
        Що в пам'яті моїй немов яскраві фрагменти.
        Я кохаю тебе за твої обіймашки,
        Від яких по моїй шкірі пробігають мурашки.
        Я кохаю тебе за твої ревнощі,
        Що завжди переходять в веселощі.
        Я кохаю тебе за те, що ти тільки моя,
        Від чого моя думка тільки твоя.
        Я кохаю тебе за те, ким я став,
        Адже ти для цього найбільша з підстав.
        Я кохаю тебе за те що ти моя половина,
        Яка появилася в моєму житті немов нестримна лавина.
        Я кохаю тебе за те що ти мене цінуєш,
        Що часто призводить до того що ти ревнуєш.
        Я кохаю тебе за твою довіру,
        І надіюсь що зможу збільшити її міру.
        Я кохаю тебе твою загадку,
        Та надіюсь що найду до тебе розгадку.
        Я кохаю тебе за чесність,
        Що приносить моїй недовірі марність.
        Я кохаю тебе за метеликів в животі,
        Що постійно створюють спогади золоті.
        Я кохаю тебе за твої поцілунки,
        Що діють на мене як зілля чаклунки.
        Я кохаю тебе за твої дотики,
        Що стали для мене немов наркотики.
        Я кохаю тебе за твої жести,
        Що допомагають настрій підвести.
        Я кохаю тебе за твоє тепло,
        Що могло б розплавити навіть скло.
        Я кохаю тебе за фарби в моєму житті,
        Що спрямовують мене на цьому путі.
        Я кохаю тебе за твої реакції милі,
        Що приносять мені радості хвилі.
        Я кохаю тебе за мій порятунок,
        Адже це найбільш можливий дарунок.
        Я кохаю тебе за те що ти світло,
        Від якого життя моє розквітло.
        Я кохаю тебе за те що ти слабкість моя,
        Прекрасна немов спів солов'я.
        Я кохаю тебе за твою віру,
        Що зігріває навіть посеред Сибіру.
        Я кохаю тебе за твою сміливість,
        Що дасть в житті не одну можливість.
        Я кохаю тебе за твою примхливість,
        Що в котрий раз показує особливість.
        Я кохаю тебе за твою манливість,
        Що показує для мене твою звабливість.
        Я кохаю тебе за твою грайливість,
        З якою не межує квапливість.
        Я кохаю тебе за твою ніжність,
        Що проводить з моєю суміжність.
        Я кохаю тебе за твою совість,
        Хоч і хочу сказати що її немає натомість..
        Я кохаю тебе за твою лукавість,
        З якою йде ще й безмежна ласкавість.
        Я кохаю тебе за твою гарячковість,
        Що часто приносить цікаву випадковість.
        Я кохаю тебе за те що ти моє найбільше досягнення,
        Та єдине моє прагнення.
        Я кохаю тебе за хімію між нами,
        Що заповнює голову мою снами.
        Я кохаю тебе за те як ти мене маниш,
        Та розум мій легко туманиш.
        Я кохаю тебе за те як ти мило злишся,
        І до мене часто казишся.
        Я кохаю тебе за те наші елементи драми,
        Що для мене стали справжніми дарами.
        Я кохаю тебе за наші розмови,
        Що подобаються мені за жодної умови.
        Я кохаю тебе за те як ти робиш неможливе,
        Перетворюючи життя моє на щасливе.
        Я кохаю тебе за всі фільми що ми подивились,
        Та під час яких так повеселились.
        Я кохаю тебе за те як я будучи журливим,
        Від розмови з тобою стаю щасливим.
        Я кохаю тебе за наші моменти,
        Що постійно викликають сентименти.
        Я кохаю тебе за будь-які дрібниці,
        Що дорожчі будь-якої скарбниці.
        Я кохаю тебе за твою привітність,
        Що стирає мою самітність.
        Я кохаю тебе за твої почуття,
        Що в мені знову розпалили життя.
        Я кохаю тебе як сенс життя,
        Який щодня продовжує моє серцебиття.
        Я кохаю тебе за те що ти є собою,
        І надіюсь що ти завжди будеш зі мною.
        Я кохаю тебе за те що ти не втомилась слухати цей вірш,
        Що може бути за 10 хвилин мого балакання гірш? 
        Я кохаю тебе за поведінку милу,
        Що викликає в мене усмішку щиру.
        Я кохаю тебе за шанс на життя з тобою,
        Я віддам все аби ти була зі мною.
        Я кохаю тебе за твою впертість,
        Що показує твою твердість.
        Я кохаю тебе за музику, що ти мені кидаєш,
        Та в серце нею прямо попадаєш.
        Я кохаю тебе за те що з тобою я живий,
        Який би не був світ навколо лихий.
        Я кохаю тебе за наші прекрасні мрії,
        Задля втілення яких я піду на будь-які дії.
        Я кохаю тебе за те, яка ти особлива,
        Для мене ти просто неможлива.
        Я кохаю тебе за твій гарнесенький носик,
        Адже ти поб'єш мене за один до нього дотик.
        Я кохаю тебе за твої щічки,
        Вкусити які я хочу посеред нічки.
        Я кохаю тебе за відчуття безпеки з тобою,
        Адже я знаю що ти за мене горою.
        Я кохаю тебе за відчуття спокою з тобою,
        Коли мої страхи й переживання немов змиває водою.
        Я кохаю тебе за твої малюнки,
        Що для моїх думок та мрій найбільші дарунки.
        Я кохаю тебе за японською фрази,
        Я такими темпами вивчу сам якісь мовні бази.
        Я кохаю тебе за безсонні ночі,
        Під час яких я хотів би дивитися в твої очі.
        Я кохаю тебе за те як ми разом засинали,
        В світ мрій і сновидінь обоє поринали.
        Я кохаю тебе за те як ми разом прокидались,
        Та з обіймів сну ледве виривались.
        Я кохаю тебе навіть за твою агресію,
        Не думав що вставлю це в поезію..
        Я кохаю тебе за твої погляди на життя,
        Адже іноді мені здається що порівняно з тобою я просто дитя.
        Я кохаю тебе за те як ти мене хвалиш,
        І одними словами з ніг просто валиш..
        Я кохаю тебе навіть за твої образи,
        Адже що б ти не робила я не відчуваю відрази.
        Я кохаю тебе за те що з тобою ніколи не буває нудно,
        І ми пройдемо все разом, наскільки б не було скрутно.
        Я кохаю тебе за те що я з тобою ніколи не один,
        При проведенні спільних годин.
        Я кохаю тебе за те що ти мене підкорила,
        Та радість і щастя в житті моєму відновила.
        Я кохаю тебе за те що ти така цундерка,
        Така ж солодка як цукерка.
        Я кохаю тебе за те що ти красуня,
        Яка часто бурчить немов бабуня.
        Я кохаю тебе за те що ти бібося,
        А я ібдося - оце так зійшлося.
        Я кохаю тебе за твій настрій мінливий,
        Як добре що я помічаю це адже такий кмітливий😔😔.
        Я кохаю тебе за те що мені не треба сильно думати над цим віршем,
        Адже настільки від серця не йшла жодна з моїх поем.
        Я кохаю тебе за те що навіть посеред всієї краси,
        Я чекаю лиш на посмішку що ти мені даси.
        Я кохаю тебе за те яка ти неймовірна,
        І настільки мені життєво необхідна.
        Я кохаю тебе за твої твіти,
        Які я читаю й забуваю іти.
        Я кохаю тебе за те що ти найкраще в моєму бутті,
        І я шукатиму тебе в кожному наступному житті.
        Я кохаю тебе за те що ти досі зі мною,
        І хочу завжди бути з тобою..
        Я кохаю тебе за те що ти мене приймаєш,
        І за всі мої мінуси мене не вбиваєш.
        Я кохаю тебе за те що я хочу аби ти була не тільки весною,
        А й літом, осінню, зимою - всім лиш би тільки зі мною..
        Я кохаю тебе за те що це вже сота причина,
        І цього вірша це вже остання хвилина. 

        Я тебе кохаю моє сонце, весна,
        Ти така прекрасна й чарівна.
        В моїх очах ти весь світ,
        З твоєю посмішкою не зрівняється довколишній цвіт.
        Будь ласка, будь завжди зі мною,
        Я заради цього будь-що скою..`,
        date: "26.08.2023 - 08.04.2024"
      },
      {
        title: "Моє кохання",
        text: `
        Тихо дивлюсь в очі твої та нервово стою,
        Кохання моє, дай мені руку свою.
        Покладу її повільно на груди мої,
        Надіюсь цей стукіт відчують пальці твої.

        Серце моє так б'ється лиш для тебе одної,
        Прекрасної в моїх очах і такої сумної.
        Не доходять мої слова, що я вдіяти можу?
        Лиш іншим шляхом я тебе потривожу.

        На серці твою руку ніжно та міцно зжимаю,
        Чи відчуваєш ти наскільки я сильно палаю?
        Своїм вогнем ціль допоможу тобі узріти,
        Навіть якщо мені прийдеться згоріти.

        Стукотом серця розіб'ю стіну між нами,
        Та темряву твою розсію вогнями.
        Забуті мрії допоможу відшукати,
        Навіть якщо для цього прийдеться сконати.

        Ти для мене немов сонце посеред вічного дощу,
        Тож нікуди я тебе через рік не відпущу.
        Можеш сміятись, називати наївним,
        Та цьому факту не бути сумнівним.
        Я тебе так сильно та щиро кохаю,
        Лиш нашого щастя в житті цьому шукаю.
        Дай життю зі мною шанс та мені надію,
        І ти побачиш що за чудо я вдію.`,
        date: "18.09.2023"
      },
      {
        title: "Божевілля",
        text: `
        Сиджу та пишу вірш цей тобі,
        Та уявляю як залишу слід на твоїй губі.
        Не хватає мені слів аби описати,
        Як сильно хочу ці слова тобі прошептати.

        Я тебе кохаю так ніжно та сильно,
        Що іноді це здається трішки божевільно.
        Хочу губи твої поцілувати,
        Та міцно тебе обійняти.

        Руку в волосся твоє запустити,
        Та все життя так прожити.
        Іншою рукою лиця твого торкнутись,
        Та від всього поганого обернутись.

        Ти стала моїм комфорту морем,
        Та відновила серце моє, вбите горем.
        Не знаю як тобі відплатити,
        Можливо життя своє присвятити?)`,
        date: "20.09.2023"
      },
      {
        title: "Струна моєї душі",
        text: `
        Весь вечір сиджу за столом,
        Стомлено об руку спершись чолом.
        Думки пливуть внікуди під тихий звук,
        Не помічаю що це ручки ритмічний стук.

        Пергамент, що був чистий та білий годину назад,
        Розкреслений словами та лініями тепер невпопад.
        Кожна ідея чи слово все не такі,
        Емоції в них, порівняно з моїми, надто слабкі.

        Як мені описати силу та чистоту кохання свого?
        Мабуть не хватить і словника людського всього.
        Адже почуття ці сильніші буревію,
        Від них я постійно шаленію..

        Щоразу не можу думати цілою добою,
        Всі мої думки зайняті тобою.
        Це стало схожим на страшенну залежність,
        З тобою я так легко втратив обережність.

        Проте я ні про що не жалію,
        Лиш далі від тебе шалію..
        Маю тепер лиш мрію одну -,
        Що я не прокинусь від цього прекрасного сну.

        Досі не вірю що це все справді наяву,
        Адже не думав що зустріну свою мрію живу.
        Я знаю, що ідеальних не існує,
        Проте кохання всі мінуси шліфує.

        Надіюсь, що ти, будучи для мене такою важливою,
        Станеш зі мною справді щасливою.
        Надіюсь, що завжди зможу твою руку тримати,
        Та від усього в цьому світі оберігати.

        Раніше я питав чи станеш ти для мене весною,
        Адже ти причина моєї боротьби з зимою.
        Проте для мене ти не просто весна,
        В інструменті моєї душі ти найважливіша струна.`,
        date: "21.09.2023"
      },
      {
        title: "Прекрасне майбутнє",
        text: `
        Я пишу цей вірш з думкою про одне,
        Прекрасне майбутнє, що так манить мене.
        В ньому у нас не буде ні тривог, ні проблем,
        Будем зігріті коло каміну яскравим вогнем.

        В будинку нашому в глибині лісів,
        Ми житимемо до кінця наших часів.
        В ньому ніколи не прозвучить злісний рев,
        Та чути буде лиш тихий шелест дерев.

        Доповнюватимуть його люблячі голоси,
        Такі чисті немов ті краплі роси.
        Подалі від злості, брехні та зради,
        Зможем просити лиш в лісу поради.

        Сюди не дістане міста залізна рука,
        Залишимось ми та свобода п'янка.
        Сюди не дістанеться шум та гамір людей,
        Лиш сміх та радість наших дітей.

        Залізна плита не давитиме мої груди,
        А я без турбот цілуватиму твої губи.
        Я нарешті зможу спокійно вдихнути,
        Спогади, що душать мене забути.

        Ти ніколи не почуватимешся одною,
        Адже я завжди буду поруч з тобою.
        За руку тебе ніжно візьму,
        Та покажу шлях через будь-яку тьму.

        Більше не буде суму в твоїх думках,
        Лиш радість та щастя буде в очах.
        І ось я простягаю руку тобі..
        Чи готова ти довіритись мені?`,
        date: "01.10.2023"
      },
      {
        title: "Усміхнись..",
        text: `
        Я пишу це аби після того як ти проснешся,
        Я був впевнений що ти чарівно усміхнешся.
        Хочу робити щасливим кожен твій ранок,
        Та приносити в ліжко для тебе сніданок.

        Хочу аби в моїх обіймах ти прокидалась,
        Та після цього ближче до мене прижалась.
        Хочу щоранку з тобою цілуватись,
        Та твоїм очима завжди милуватись.

        Хочу ніколи тебе не відпускати,
        Та поруч з собою постійно тримати.
        Хочу аби усмішка твоя була тільки моєю,
        А я міг ділитись тільки з тобою своєю.

        Хочу для тебе стати ідеальним,
        Хоча і звучу зараз банальним.
        Хочу аби ти була всім задоволена зі мною,
        Та більше ніколи не ставала сумною.

        Це лиш невеличка частина моїх бажань,
        В яких я бережу тебе від усяких страждань.
        Я зроблю усе аби втілити їх в життя,
        Та відчувати поруч твоє серцебиття.

        Я це казав вже стільки раз,
        Що мені не хватає нових фраз.
        Проте я тебе справді кохаю,
        Та коли ти прокинешся чекаю.
        Тож, кохана моя, проснись,
        Глянь на мене та усміхнись.`,
        date: "08.10.2023"
      },
      {
        title: "Поки сонце не встане..",
        text: `
        Пройшло вже місяці чотири,
        Наших стосунків з тобою,
        Ціную сильно всі ці години,
        Повні щастя й покою.

        Досі пам'ятаю наше перше "кохаю",
        Сказане мною затамувавши подих,
        Навіть зараз від почуттів цих згораю,
        Страждаючи від переживань схожих.

        Я вперше пишу вірші в такому стилі,
        Мабуть не надто добре вдається, знаю,
        Але сьогодні в душі моїй такі хвилі,
        Тож дати тобі щось нове від себе бажаю.

        Хочу сказати як сильно тебе кохаю,
        Як сильно продовжуватиму тебе кохати,
        Як сильно та щиро я бажаю,
        Разом з тобою всі проблеми здолати.

        Ти робиш мене найщасливішим в світі,
        Я старатимусь дати тобі те ж саме,
        Давай сидітимемо в обіймах наших зігріті,
        Поки сонце нарешті не встане..`,
        date: "13.12.2023"
      },
      {
        title: "Муки(1)",
        text: `
        Мучусь, стараюсь терпіти, 
        Проте моє тіло може тільки тремтіти.
        Голова повна спогадів щасливих,
        Поруч з ними думок багато жахливих.
        Я не хочу жити без тебе, кохання моє,
        Адже мій розум, душа та серце - твоє.
        Я сходжу з розуму мабуть,
        Адже бажання всі повністю кануть.
        З тобою лиш бути бажаю,
        Щоб ти спробувала тебе я благаю..
        Пересилити себе, побороти,
        Це ж краще ніж серця наші проколоти...
        Я тебе так сильно кохаю.. 
        Без тебе в муках нестерпних конаю.`,
        date: "16.02.2024"
      },
      {
        title: "Муки(2)",
        text: `
        Всю ніч моє серце від болю волало,
        Бажання жити без тебе пропало.
        Як мені без тебе далі триматись,
        Можу лиш в агонії час весь звиватись.

        Я тебе так сильно кохаю,
        Життя з тобою провести бажаю.
        Я не можу без тебе, просто не можу,
        Лиш по кімнаті тривожно я ходжу.

        Ти весь мій світ, ти все що у мене є,
        Відсутність тебе мене просто вб'є.
        Я не протримаюсь довго, я знаю,
        Лиш як повернути тебе я гадаю..

        Не хочу щоб ти відчувала біль,
        Тому не можу на рану сипати сіль.
        Але я справді без тебе нічого не хочу,
        Лиш твоє ім'я цілими днями шепочу.

        Падають сльози коли я це пишу,
        Ти чуєш мене? Я ніколи надію не лишу!
        Я буду мріяти навіть у життя свого кінці,
        Уявлятиму тебе у весільному вінці..

        Мені насправді тільки одне ж потрібно -,
        З тобою в кімнаті життя провести незмінно.
        Адже в моєму серці назавжди лиш ти одна,
        Така прекрасна й унікальна весна...`,
                date: "17.02.2024"
      },
      {
        title: "Муки(збірка)",
        text: `
        Сльози далі ллються градом,
        А я немов задихаюся газом.
        Усе що маю без вагання б віддав,
        Лиш би бажання спробувати в тобі я здійняв...
        ----------------------------------
        Голова розколюється, в очах все пливе,
        Бажання померти невпинно росте..
        Агонія мене ніяк не відпускає,
        Холод без тебе постійно підступає.
        Серце за тобою нестерпно болить,
        А душа полум'ям все сильніше горить.
        Кохаю, кохаю, кохаю, кохаю, кохаю,
        Без тебе я таки точно сконаю.
        -----------------------------------
        Пишу ці вірші та надіюсь що ти їх читаєш,
        Проте чи правда це я не дізнаюсь...
        -----------------------------------
        Ці дні так сильно тошнить,
        Моя психіка буквально тріщить..
        Навіть зараз я чую твій голос, твій сміх,
        За все життя це найбільша з втіх..
        Твій голос ніяк не йде в мене з голови,
        Я програю всі наші розмови та голоси..
        Постійно згадую твої очі..
        Та наші чудові разом ночі..
        Я не хочу втрачати це все..
        Адже всередині мене все вмре..
        -----------------------------------
        Подумай ще трошки, благаю..
        Я ж тебе так сильно кохаю..
        Мені без тебе життя зовсім не миле,
        Все хороше в мені зараз гине..
        -----------------------------------
        Все всередині так сильно болить..
        Я не зміг позбутися думок про тебе ні на мить..
        Я тебе так сильно кохаю..
        І я за тебе сильно переживаю..
        Мені страшно чи з тобою все добре..
        Від сліз переживань все на мені мокре..
        -----------------------------------
        Моє кохання до тебе ніколи не згасне,
        Воно світитиме як сонце тепле і ясне..
        Завжди на тебе буду чекати,
        Та постійно думаю як тебе переконати.
        Я не знаю що мені робити..
        Я не можу ні секунди без думки про тебе прожити..
        -----------------------------------
        Моє серце нестерпно страждає,
        Адже воно лиш для тебе палає.
        Не хочу життя без тебе я в ньому,
        Не надаю уваги більше нічому..
        Мрію твій голос знову почути,
        Та решту життя з тобою пробути..
        Ну чому все має бути так,
        Я втратив до всього вже смак.
        ХОЧУ БУТИ З ТОБОЮ,
        ІНАКШЕ НЕ БУТИ МЕНІ СОБОЮ😭😭
        -----------------------------------
        Сьогодні мені снилося що це все сон,
        Ми разом і ти розказуєш про цікавий закон..
        Я з задоволенням слухав голос твій ясний,
        Та думав наскільки з тобою світ мій прекрасний.
        Тільки врешті-решт я проснувся...
        І одразу до грудей я торкнувся -
        Там все шалено без тебе болить,
        Цей біль не тільки розум а й тіло моє зморить..
        Я тебе так сильно та шалено кохаю,
        В подушку постійно без тебе ридаю.
        Ладен душу, серце та розум свої продати,
        Аби до кінця свого життя тебе обіймати.
        -----------------------------------
        Вийшов з душу, дивлюсь на своє лице,
        З кожним днем воно все менше живе.
        Губи втратили колір, абсолютно бліді,
        Тепер більше ніж людині я подібний біді.
        Під очами синці, а самі очі розпухли,
        А вуха давно вже оглухли..
        Нічого більше не чую, окрім голосу твого,
        В якому немає нічого поганого чи злого..
        Лиш те що завжди гріло моє серце,
        Яке до тебе було абсолютно замерзле.
        Мабуть я вже з розуму зійшов,
        Адже далі я не пішов. 
        Я лишився в фантазіях з тобою,
        Де ти завжди будеш зі мною..
        Це тіло тепер лиш шмат плоті,
        Чиє життя висить на тоненькому дроті.
        Я дивлюся на себе з огидою,
        Адже не сприймаю себе навіть людиною.
        Я втратив кохання всього життя,
        Та навіть так буду кохати тебе до кінця..
        Я просто хочу щоб ти була зі мною:(((
        Адже тільки ти завжди будеш моєю весною(((
        -----------------------------------
        Над всім ж можна працювати..
        Саме так можна наші стосунки врятувати..
        Хіба все що було між нами того не варте??
        -----------------------------------
        Так сильно за тобою скучаю,
        Без тебе в житті я лиш безцільно блукаю.
        Ти для мене така дорога,
        Така прекрасна й близька.
        Найрідніша, найдорожча людина,
        Так хочеться аби й майбутня дружина..
        Я не згоден з цією долею, ні,
        Я не хочу провести без тебе життя мого дні.
        Я ж для тебе такий особливий..
        Чому для зусиль твоїх недостатньо важливий...
        Серце так сильно болить...
        Написати тобі так і кортить(
        -----------------------------------
        Знову на мене кричать,
        Мої руки шалено дрижать.
        Тепер тебе немає поруч,
        Тож я маю триматися власноруч..
        Але я ніяк не можу..
        Знову попадаю в кімнату ту схожу..
        Так сильно зараз всього трясе,
        Мене нічого тепер не спасе.
        Мене ніхто не заспокоїть,
        Та рани мої ніхто не загоїть.
        -----------------------------------
        Ну чому все так має бути..
        Я так хочу від тебе почути..
        Що ти передумала, готова спробувати..
        Лиш ця надія не дає мені себе втоптувати
        -----------------------------------
        Я тебе так сильно кохаю,
        Я без тебе в муках конаю..
        Задихаюсь немов газом,
        Та навіть так шепочу що у нас може бути майбутнє разом.
        В нас же стільки всього що ми мали зробити,
        Я не зможу без цього прожити..
        -----------------------------------
        Серцю боляче, душі погано,
        В'язке почуття в грудях все більше зростало.
        Знову я задихаюсь,
        Та ніким залишаюсь.
        Образа десь там тихо шепоче,
        Та злість несамовито регоче.
        Тіло від холоду так сильно тремтить,
        Голос в голові те саме твердить.
        Ще більше він мене принижає,
        Та зі спокою рідкісного вириває.`,
        date: "17.02.2024 - 22.02.2024"
      },
      {
        title: "Надто прості слова..",
        text: `
        Знову починаю тобі вірш я писати,
        Та не знаю з чого варто почати...
        "Моє сонечко, киця, кохання"
        Яке слово серця мого опише поривання..

        Будь - які слова це не те,
        Для моїх почуттів все це надто просте..
        Мабуть ніяк не вийде описати,
        Я ж постійно буду тебе все більше кохати..

        Кожен день, годину, секунду та мить,
        Моє серце за тобою все більше щемить.
        Мої розум, душа та серце в твоєму полоні,
        Думаю лиш про те як тримати твої долоні..

        Мені нічого в цьому світі не потрібно,
        Лиш лежати разом хом'ячкам подібно.
        Тільки щоб ми та серця наші разом були,
        А а нашому домі були справжні акули))`,
        date: "22.02.2024"
      },
      {
        title: "Крик серця",
        text: `
        Дні все йдуть, стає холодніше,
        Крик мого серця щодня голосніше.
        Нічого чути більше не бажаю,
        Лиш про те як руку твою тримати гадаю.

        Можеш називати мене наївним, дурним,
        Інфантильним, романтичним, чудним.
        Проте я справді лиш цього бажаю,
        Обійняти й передати як тебе я кохаю.

        Ти можеш не вірити в мої почуття,
        Зрозумієш що справжні вони через призму життя.
        Решту якого я проведу лиш з тобою,
        Моєю прекрасною й коханою весною.

        Я знову пишу те що й раніше..
        І моє розчарування в собі все сильніше.
        Не в змозі почуття свої словами передати,
        Продовжую прості віршики для тебе писати..

        Хочу написати слова що будуть так сильно тягнутись,
        Аби могли вони серця твого торкнутись.
        Викликати в душі твоїй тепло,
        Що б усе погане потоком знесло.

        Щоб ти усміхнулася коли почуєш ці слова,
        Це б мене зігріло краще за будь-які дрова.
        Адже лиш усмішку хочу тобі дарувати,
        І все життя поруч бути й за руку ніжно тримати..`,
        date: "08.03.2024"
      },
      {
        title: "Страх",
        text: `
        Я тебе кохаю шалено,
        Боюся що ти підеш просто скажено.
        Ти весь мій світ,
        Прекрасний немов весняний цвіт.

        Я знаю що це складне здобуття,
        Але як мені вернути твої почуття?
        Як мені бажання в тебе вернути,
        Щоб ти хотіла зі мною бути...

        Постійно згадую про твою печаль,
        За час зі мною ти відчуваєш жаль..
        Мене це так сильно болить..
        В мене немає права навіть про шанс молить..

        Але я все ще це роблю,
        Заради твого кохання пройду навіть через стіни вогню..
        Мені нікого окрім тебе не треба,
        Лиш хочу лежати з тобою просто неба .

        Дивитися разом на зірки,
        Та проводити знову веселі дзвінки.
        Тримати тебе за руку,
        І в милі моменти не видавати жодного звуку.`,
        date: "15.03.2024"
      },
      {
        title: "Дурник та його почуття",
        text: `
        Пройдуть хвилини, години, дні,
        Я все ще відчуватиму почуття ці чудні..
        Вони такі дивні, такі сильні,
        Робити щасливим мене схильні.
        
        Ці почуття в мені з того моменту,
        Коли ти підкорила в мені все дощенту.
        Здавалося, ти навіть не зробила багато дій -
        І от я вже повністю твій.
        
        Кожен сантиметр тіла мого,
        Бажає у всьому світі лиш одного -
        Бути з тобою навіки віків,
        В кожному з наших життів та світів.
        
        Цього бажає й душа моя,
        Яка, можна сказати, тепер вже твоя..
        Адже тільки для тебе всередині щось муркоче,
        І від голосу й сміху твого все тріпоче.
        
        Цього бажає й моє серце,
        Що немов мрій моїх люстерце.
        Адже в ньому видно лиш дівчину одну -
        Тебе, кохана, - мою прекрасну весну.
        
        Цього бажає й моя свідомість,
        Якій здавалося б була рідна суворість..
        Проте перед тобою все це різко пропало,
        Мабуть саме тоді моє серце розтало.
        
        Ти вже зрозуміла про які почуття я пишу,
        Адже ними я тільки й живу..
        Це звісно ж моє кохання,
        Якому, як ти помітила, не властиве мовчання.
        
        Я тебе кохаю, кохана моя,
        Смішний я і ця тавтологія..
        Але такий вже я є,
        Дурник, в якого є тільки кохання моє.`,
        date: "12.03.2024"
      },
      {
        title: "Сльози",
        text: `
        Стіни цієї кімнати настільки тісні,
        З радістю проміняв би їх на краєвиди лісні.
        Звісно ж в цьому бажанні є ти,
        Яка хоче від мене піти...
        
        Тепер це у мене постійно в думках,
        У всіх свідомості моєї кутках.
        Я не потрібен тобі, ти мене не кохаєш,
        Навіть найменших емоцій не відчуваєш.
        
        Я б усе важливе що в мене є віддав,
        На життя з тобою без сумнівів проміняв.
        Я більше нічого не хочу,
        Лиш твоє ім'я крізь сльози шепочу.
        
        Сильне бажання припинити своє існування,
        Цьому не завадить жодне лікування.
        Я лиш хочу бути з тобою,
        Моєю коханою весною..
        
        Я пам'ятаю всі наші моменти,
        Без майбутнього з тобою хочеться померти.
        Я пам'ятаю як ти казала "кохаю",
        І без цього я від болю волаю.
        
        А як же моя книга з віршами..
        Як же все те що було між нами..?
        Як можна на цьому ставити хрест?
        Моя душа кричить від болю в протест.
        
        В мене йде земля з-під ніг,
        Тепер я на холодній підлозі ліг.
        Без тебе мій світ руйнується,
        А біль цим годується.`,
        date: "15.03.2024"
      },
      {
        title: "Шанс",
        text: `
        Я тебе так сильно кохаю,
        Про шанс тебе тільки й прохаю.
        Шанс вернути все, що між нами було,
        Щоб відсутність емоцій до мене знесло..
        
        Я виправлюсь, всі можуть стати кращими,
        Наші стосунки ніколи не будуть важчими.
        Наоборот - вони стануть легше й здоровіше,
        Адже вони для мене за будь-що важливіше.
        
        Я знаю що це не звучить зараз нормально,
        Проте я готовий до змін в собі вже морально.
        Я піду до психолога, виправлю проблеми,
        І далі писатиму тобі романтичні поеми.
        
        Тільки вже без ревнощів, без тиску,
        Заради всього що ми пройшли я відполірую себе до блиску..
        Адже ти моя прекрасна весна,
        Дівчина, що мною настільки кохана й неземна.`,
        date: "16.03.2024"
      },
      {
        title: "Утрата",
        text: `
        Я тебе так сильно кохаю,
        Шалено за стосунками нашими скучаю.
        Тепер для тебе я брат,
        Це найбільша з усіх моїх втрат..
        
        Мене так сильно серце болить,
        Всередині все вертить й щемить.
        Я мрію тепер лиш про одне -,
        Проте як кохання твоє до мене цвісти знову почне..
        
        Я знаю що це ще можливо,
        Просто останнім часом між нами дощило.
        Але все можна пропрацювати,
        І заради нашого майбутнього разом всі сили віддати`,
        date: "17.03.2024"
      },
      {
        title: "Тремтіння душі",
        text: `
        Моє серце так сильно стучить,
        Душа перед зустріччю з тобою неймовірно тремтить.
        Мені жарко, я шалено хвилююсь,
        Тому, що ти на побаченні зі мною досі й дивуюсь.
        
        Руки пітніють, я весь трясусь,
        В коханні своєму тобі я щиро клянусь.
        Бути з тобою одною лиш я бажаю,
        Кажу все що поруч з тобою відчуваю.
        
        Ти єдина кохана в моєму житті,
        Хочу аби наші серця завжди були близькі.
        Хочу руки твоєї торкнутись,
        І разом з тобою в обіймах забутись.`,
        date: "17.03.2024"
      },
      {
        title: "Биття серця",
        text: `
        Я тебе шалено кохаю,
        Бути з тобою вічно бажаю.
        Ти моє сонце, моя весна,
        Що фарби в моє життя принесла.
        
        Я хочу з тобою завжди в обіймах лежати,
        За небом й зірками ночами спостерігати.
        Я хочу руку твою не відпускати,
        В майбутнє, як чоловік твій, з тобою рушати.
        
        Я хочу дати тобі все своє кохання й тепло,
        Щоб все погане з твого життя віднесло.
        Я хочу щоб ти відчула серця мого биття,
        Та зрозуміла що я не хочу без тебе цього життя.`,
        date: "18.03.2024"
      },
      {
        title: "Темрява й надія",
        text: `
        Нарешті в полі зору немає людей,
        Я торкнувся легко своїх грудей..
        Серце б'ється так сильно та швидко,
        Від костей та плоті своїх мені гидко.
        
        Хочу вирвати серце собі,
        Та віддати прекрасній весні.
        Тобі лиш одній його я віддам,
        Незважаючи ні на що я довіряю твоїм рукам.
        
        Воно так сильно задля тебе б'ється,
        В обійми до тебе несамовито рветься.
        Воно є і завжди буде твоє,
        Адже вічне кохання до тебе моє.
        
        П'ю таблетки різні постійно,
        Не стає від них ні каплі спокійно.
        В голові шлях лиш один -,
        Стати однією з похмурих домовин.
        
        Холодне лезо гладить шкіру,
        Я поступово починаю втрачати міру.
        Біль фізичний не глушить ментальний,
        Адже той ніж набагато гостріший й летальний.
        
        Я не бачу світла, лиш темрява довкола,
        Проте раптово надія моє серце вколола.
        "Ще не все втрачено, не здавайся,"
        Раптово голос скривився: "або дій і не ламайся".
        
        Згадую твій сміх та відкидаю я ніж,
        Відкриваю вікно на балкон я навстіж.
        Дивлюся на небо похмуре і зорі,
        Ми розглядатимемо їх разом надворі.
        
        Я знаю це, відчуваю,
        Віру в нас не відпускаю.
        Я знаю що є те всередині тебе,
        Що розпалить вогонь твій до мене.
        
        Слухаю ці інтернет-поради дурні,
        Вони всі маніпулятивні й смішні.
        Я знаю свої недоліки,
        Але я ніколи не бажав набути жорстокої символіки.
        
        Я не буду прикидатися більше ким я не є,
        І відновив вже нарешті "я" своє.
        Я тебе справді сильно кохаю,
        Тому тим більше ховатися не бажаю.
        
        Я погляну тихо на ніж посеред столу,
        І наступного кроку падаю додолу.
        Немає сил в цьому тілі,
        Все тримається лиш на одній вірі.
        
        Вірі в те що я буду руку твою тримати,
        І мені ніколи не прийдеться її відпускати.
        Я тебе щиро кохаю.
        І зробити тебе щасливою бажаю.`,
        date: "19.03.2024"
      },
      {
        title: "Прекрасний сон",
        text: `
        Проснувся я від прекрасного сну,
        Заради того що там було я навіть помру.
        Ми лежали разом й споглядали зірки,
        Поруч від вітру шелестіли дерева гілки.
        
        Ти прижалася до мене поближче,
        І моя душа здійнялася навіть вище.
        Я відчуваю як зв'язок між нами стає тісніший,
        В усьому світі я - найщасливіший.
        
        Я ніжно поцілував тебе в лоба,
        Адже в носа не вдалася б моя спроба).
        Я тримаю твою руку весь цей час,
        З тобою я ніколи не чую навколишній глас.
        
        Я дивлюсь в твої очі щоразу,
        І усміхаюсь як ти їх відводиш одразу.
        Досі шарієш й переживаєш,
        Красотою своїх очей ти мене вимикаєш.
        
        Ти торкнулася рукою мого лиця,
        І зникло навколо все життя.
        Лиш доторк твій я відчуваю,
        Щоб ти поцілунок свій подарувала бажаю.
        
        Хах, я теж дуже сильно хвилююсь,
        Закриваю очі нервово й готуюсь.
        Подолавши головою половину шляху,
        В наступний момент я відчув себе подібно птаху.
        
        Я відчув доторк губ твоїх,
        Що немов ідеальна пара для моїх..
        Світ спинився, час перестав мати владу,
        Немов я лечу посеред прекрасного саду..
        
        І от я проснувся після моменту в раю,
        Та безсилий з ліжка свого встаю.
        В кімнаті холодно й похмуро,
        Тіло знову таблетку ковтнуло..
        
        Хоча вони не те щоб помагали,
        Лиш ілюзію того що мені краще давали.
        І от я стою та дивлюся у вікно,
        З самопочуттям немов я гівно..
        
        Ми можемо сон мій втілити в реальність..
        Або може це звучить для тебе як нахабність..
        Але я тебе справді так сильно кохаю,
        Жити цим сном я тільки й бажаю.
        
        Скажи що це правда, що це можливо,
        Це ж стільки щастя в життя наші б вносило..`,
        date: "20.03.2024"
      },
      {
        title: "Поганець",
        text: `
        Я дуже сильно за тобою скучаю,
        Без тебе я в темряві постійно блукаю.
        Щоночі ти мені снишся,
        Боюсь що без мене ти жити вчишся..
        
        Лишилося ще кілька днів..
        Сповнені лиш пов'язаних з тобою снів.
        Не можу без тебе ці дні прожити,
        Можу тільки постійно тужити..
        
        Сиджу та сумую за своєю весною,
        Надіюсь що ти завжди будеш зі мною.
        З таким поганцем як я,
        Який помилки робить щодня.`,
        date: "25.03.2024"
      },
      {
        title: "Мрії й краєвид",
        text: `
        Світить сонце, дує теплий вітерець,
        Хотів би я понести тебе так під вінець.
        Так приємно в руках тебе тримати,
        І прекрасний аромат твого волосся вдихати.
        
        Світ навколо розмився в суцільну пляму,
        А ти знищила в грудях моїх бездонну яму..
        В вухах лунає тільки твій радісний сміх,
        Твоє щастя  найбільша з усіх моїх утіх.
        
        Ноги йдуть самі - крок за кроком угору,
        А голова та думки мої немов в тумані густому.
        Уявляю лише нас обох в квартирі тісній,
        Трішки обшарпаній, з завішаними вікнами, немов німій..
        
        Адже між нами не потрібно жодних слів,
        Ми можемо так пробути сотні, тисячі днів.
        Поки ти боком в мене на колінах лежиш,
        Я гладжу тебе поки ти знову мило заспиш.
        
        Після цього я тебе легко в наше ліжко покладу,
        Та ляжу поруч й міцно тебе обійму.
        Ми будемо мирно спати в купі покривал,
        Для нас в морі життя це наш рідний мирний причал.
        
        Я б і далі в мріях наших теплих блукав,
        Якби твій голос в моїх вухах знову не пролунав.
        Ми піднялися нарешті на вершину,
        Проте дивився я не на місто а на свою кохану єдину.
        
        Ти прекрасніша за будь-який краєвид,
        Адже для мене найважливіше це твого щастя вид.
        Я тебе кохаю, дівчинка моя,
        Найкраща та чудова весна.`,
        date: "20.04.2024"
      },
      {
        title: "Підійди..",
        text: `
        Підійди, кохання моє,
        Я віддам тобі серце своє.
        В грудях воно шалено б'ється,
        До тебе постійно рветься.
        
        В обійми свої хочу тебе загорнути,
        Аби серця наші змогли поруч побути.
        Торкнутися ніжно твоїх пальців,
        Та поринути в перший з наших танців.
        
        Посеред тепла, вітру, снігу чи дощу,
        Поруч з тобою я постійно горю.
        Палають почуття всередині грудей,
        Нам байдуже на довкола людей.
        
        Ми танцюємо за любої погоди,
        Байдуже нам на вітри та негоди.
        Ми усміхнені й щиро щасливі,
        Наш сміх не стихне навіть при зливі.
        
        Я триматиму завжди руку твою,
        Перед будь-чим поруч з тобою встою.
        Пройдемо через холод, пекло чи темряву чорну,
        Не програємо битву за нас жодну.
        
        Я погляну в твої чудові очі,
        Цей вид краще за зорі посеред ночі.
        Я тебе кохаю, ніколи не підведу,
        До щастя попереду на руках тебе донесу.`,
        date: "22.04.2024"
      }
  ];

  slides = this.poems.map((poem, index) => ({
    key: uuidv4(),
    content: <Poem title={poem.title} text={poem.text} date={poem.date} />,
    onClick: () => this.setState({ goToSlide: index })
  }));

  onChangeInput = (e) => {
    this.setState({
      [e.target.name]: parseInt(e.target.value, 10) || 0
    });
  };

  handleTouchStart = (evt) => {
    if (!this.state.enableSwipe) {
      return;
    }

    const firstTouch = getTouches(evt)[0];
    this.setState({
      ...this.state,
      xDown: firstTouch.clientX,
      yDown: firstTouch.clientY
    });
  };

  handleTouchMove = (evt) => {
    if (!this.state.enableSwipe || (!this.state.xDown && !this.state.yDown)) {
      return;
    }

    let xUp = evt.touches[0].clientX;
    let yUp = evt.touches[0].clientY;

    let xDiff = this.state.xDown - xUp;
    let yDiff = this.state.yDown - yUp;
    if (Math.abs(xDiff) > Math.abs(yDiff)) {
      if (xDiff > 0) {
        /* left swipe */
        this.setState({
          goToSlide: this.state.goToSlide + 1,
          xDown: null,
          yDown: null
        });
      } else {
        /* right swipe */
        this.setState({
          goToSlide: this.state.goToSlide - 1,
          xDown: null,
          yDown: null
        });
      }
    }
  };

  componentDidMount() {
    window.addEventListener("keydown", this.handleKeyDown);
  }

  componentWillUnmount() {
    window.removeEventListener("keydown", this.handleKeyDown);
  }

  handleKeyDown = (e) => {
    switch (e.keyCode) {
      case 37:
        this.setState({ goToSlide: this.state.goToSlide - 1 });
        break;
      case 39:
        this.setState({ goToSlide: this.state.goToSlide + 1 });
        break;
      default:
        break;
    }
  };

  render() {
    return (
      <div
        style={{ width: "80%", height: "500px", margin: "0 auto" }}
        onTouchStart={this.handleTouchStart}
        onTouchMove={this.handleTouchMove}
      >
        <Carousel
          slides={this.slides}
          goToSlide={this.state.goToSlide}
          offsetRadius={this.state.offsetRadius}
          showNavigation={this.state.showNavigation}
          animationConfig={this.state.config}
        />
      </div>
    );
  }
}
